# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

n = input('Введите трехзначное число: ')
summa = int(n[0]) + int(n[1]) + int(n[2])
print(summa)
