# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов.
# Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок,
# если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# *Пример:*

# 6 -> 1  4  1
# 24 -> 4  16  4
#     60 -> 10  40  10

quantity = int(input('Введите количество сделанных журавликов: '))
quantity_boy = int(quantity / 6)
quantity_kate = int(quantity_boy * 4)

print(f"{quantity} -> {quantity_boy} {quantity_kate} {quantity_boy}")
